{"summary":[{"Summary":" As a seasoned software engineer at Fortune 500 companies, I have contributed to more than 30 professional projects as a team member and have developed more than 20 utility tools as an individual. I spend most of my time developing frameworks\\platforms, client-server applications and auxiliary tools. I am thoughtful, insofar as trying to use the best algorithms and design patterns, as well as pragmatic to ship the product on time. I label myself as a curious engineer who can make quick hacks using libraries or spend hours to prove a greedy algorithm. I participate in competitive programming through codeforces and TopCoder. I also maintain my academic bonds through open MOOC platforms such as Coursera and Udacity.\n\n"}],"education_and_training":[{"Certifications":" C# 4.0 Master Brainbench License 7691089 November 2012 ASP.NET 4.0 Brainbench License 7691089 February 2013 JavaScript 1.5 BrainBench License 7691089 October 2012 SQL Server 2008 Programming BrainBench License 7691089 August 2012 Design Patterns Brainbench License 7691089 C# 3.0 Master Brainbench License 7691089 January 2012 Object Oriented Concepts Brainbench License 7691089 SQL Server 2005 Programming Brainbench License 7691089 .NET framework Fundamentals Brainbench License 7691089 Presentation Skills BrainBench License 7691089 Project Management Brainbench License 7691089 UML Brainbench License 7691089 Business Communication Brainbench License 7691089 Business Mathematics Brainbench License 7691089\n\nPage4\n\nMicroEconomic principles Coursera - University of Illinois Urbana Champaign\n\n"},{"Courses":"\n\nIndependent Coursework\n\nPage5\n\nDesign of Programming Languages CS212\n\n"},{"Education":" ICFAI University Post Graduate Diploma, Logistics, Materials, and Supply Chain Management, 2006 - 2007 Grade: 3.5 Anna University Bachelor of Engineering (B.E.), Electrical and Electronics Engineering, "}],"skills":[{"Skills & Expertise":" Microsoft SQL Server C# ASP.NET ASP.NET MVC jQuery JavaScript Python HTML CSS3 .NET CLR NUnit Managed Extensibility Framework Design Patterns Data Driven Testing LINQ MSBuild Regular Expressions Bash CSS Database Design Software Development\n\nPage6\n\n"},{"Languages":" English (Full professional proficiency) Tamil (Professional working proficiency) French (Elementary proficiency)\n\n"},{"Programming Languages":" CS262\n\nSoftware Debugging CS259\n\nAdvanced Design and Analysis of Algorithms from Stanford Online\n\n"}],"basics":{"gender":"male","name":{"firstName":"Antony","surname":"Thomas","middleName":"Deepak"},"title":"Software Engineer","email":["antonydeepak@gmail.com"]},"work_experience":[{"date_start":"August 2013","jobtitle":"Software Engineer","text":" - Present (1 year 6 months)\n\nWorked in developing Advertising SDK and experiences for Xbox360. Have expertise in programming languages and development models of both the X360 and XOne platforms. Specialized in developing gesture and voice based controls. Used tools that assisted in console debugging, application side-loading and game development. Worked in developing Advertising SDK for iOS and Android platforms. Developed modules related to message-passing between native and non-native layer and network, motion and message-queue management . Used tools that assisted in run-time memory analysis, code coverage,threat modelling and application development. Working in developing a sub-module for the future Windows version. Using tools related to kernel debugging and virtual machine management.\n\n"},{"date_start":"June 2012","jobtitle":"Software Developer","organization":"JPMorgan Chase","date_end":"August 2013","text":" (1 year 3 months)\n\nCurrently building a platform that will consolidate 12 or more applications into a unified system; Leveraging Dependency injection container and other best practices from Microsoft patterns and practices. Developed code pattern analyzer that categorizes Visual Basic subroutines into logical groups such as data access components, text formatters and business objects. Authored data-driven testing framework classes that support sequential data access, data filtering, batch and individual testing. These classes enhance the existing Unit testing framework from Microsoft. Built utility applications, such as config builder, executable comparer, pseudo code generator, and static code analyzer that saved man-hours for fellow developers. Enhanced and supported NY state, Single File, and Custom Edit validator module. These modules validate millions of tax forms that are processed through Brainware OCR. Member of the weekly build and regular release teams. Rewrote critical parts of the tax validator application for NY State. Corrected faulty\n\nPage2\n\ninheritance, introduced typed datasets and separated presentation aspects from business. Toolkit : C#, Python, .NET 3.5,4.0, MSbuild, SQL Server 2005 & CE, Regular Expressions, and GNU utils.\n\n"},{"date_start":"June 2011","jobtitle":"Software Developer","organization":"JPMorgan Chase","date_end":"June 2012","text":" (1 year 1 month)\n\nBuilt a complete relationship data graph for Customer tracking application. The graph maps every UI component to its related stored procedures, tables, functions and, eventually, to the database field. Later, this graph helped in more ways than imagined. Part of the core development team in a fast-paced check processing application; Had exposure to contemporary software practices such as rapid development, continuous integration, nightly builds, daily reviews, concurrent test cases and automated builds. Member of the engineering team responsible for enhancing,testing and deploying seven Web applications built using ASP.NET framework. Part of the development team that changed the authorization framework from SSO policy servers to enterprise backbone EAST services. Developed an automated build utility that creates build packages and configuration files. Created a proof of concept using the JBoss drools engine for a rules driven application. Toolkit : C#, ASP.NET, ASP, NUnit, Java, Drools, SQL Server 2005 database, SSRS and vb6 .\n\nApplication "},{"date_start":"October 2008","jobtitle":"Lead Engineer","organization":"Toyota Motor","date_end":"March 2011","text":" (2 years 6 months)\n\nLed a team that was responsible for eight applications that support Toyota’s functional areas such as Customer services, Dealer operations, and Finance and Education services - all serving more than 1000 users. Identified and improved 94 pain points in all 8 applications thus saving 3000$ in person hours. Designed and developed a regression testing tool that gained firmwide recognition; Won “Star Performer” award from Toyota Motor Sales. Produced better code by refactoring control flows, improving standards and cleaning the dead and unreachable; Final statistics showed a 64% reduction in code complexity and 10% improvement in system stability.\n\n"},{"date_start":"May 2007","jobtitle":"Cofounder","date_end":"May 2009","text":" (2 years 1 month)\n\nPartnered with my friend and started our own Small Business - Book Lending Library- that caters to more than 800 book readers and houses more than 12,000 books. Designed and organized Innovative marketing campaigns - Childfest & Naturefest - that increased business footfall by 20% and children membership by 50% per month. Introduced the concept of Virtual library– a common stock of books shared by two libraries – that significantly reduced inventory costs. Lauded by National Newspaper, “The Hindu” and Local Newspaper, “Adyar Times” for services to the book reading community. Invested more than 60 hrs per month,while still serving as a Full-time Software Professional. Experienced and overcame classic challenges in a business: sales slump, poor logistics, failed promotions, capital crunch, irate customers, challenging employees, and threatening termination. Toolkit : Leadership, Communication, Creativity, Open Mindedness\n\n"},{"date_start":"3\n\nOctober 2005","jobtitle":"Web Developer","organization":"Cognizant Technology Solutions","date_end":"October 2008","text":" (3 years 1 month) Part of the team that Designed and Developed pricing application; Predominantly worked on custom controls, data-bound events, CSS templates and AJAX requests. Received the “Diamond in the Rough” award for learning the pricing system and producing quality bug fixes in a short time. Worked in a Project Management system. Created charts and graphs using graphics class libraries in dotNET; Worked in reports using SQL server reporting services. Hosted ASPNET webpages in Plumtree portal, a.k.a BEA Aqualogic. Toolkit : C#, SQL server 2000 & 2005, AspNET v 1.1 & 2.0, ADONET, Aqualogic and SSRS.\n\nTest Scores GMAT - Graduate Management Aptitude Test December 2010 Score:720(94%)\n\n"},{"Projects":" 2048 Asisst June 2014 to Present Members:Antony Deepak Thomas\n\nArtificial intelligence game solver for the popular 2048 game. Game at http:\/\/www.windowsphone.com\/en- us\/store\/app\/2048-assist\/dcf7723d-8ad2-46f4-a5ce-7f43d8a72bc7\n\nHercules 500$ Robot November 2013 to Present Members:Antony Deepak Thomas\n\nWorked on a community project for building a 500$ robot. Stanford CS97Si - Competitive programming course March 2014 to Present Members:Antony Deepak Thomas\n\nSolutions for Stanford programming course CS97SI. The problems are from Peking Online Judge. Mazesolver May 2013 to Present Members:Antony Deepak Thomas\n\nMaze puzzle solver using graph search. Practical DataStructures & Algorithms January 2013 to Present Members:Antony Deepak Thomas\n\nA Collection of popular and interesting datastructures, algorithms and programming puzzles using C# and Python. More than 30 algorithms and one new almost every week.\n\nCS212 - Solution Book July 2012 to Present Members:Antony Deepak Thomas\n\nSolution book for the CS212 course. Includes algorithms for 1) Parking Lot Search - Shortest Path 2) Logic Puzzle - Similar to Zebra puzzle 3) Darts Probability - Mathematics 4) Portmanteau - Word game algorithm\n\npaellachicago.com March 2012 to April 2012 Members:Antony Deepak Thomas, Gobi Muthuramalingam\n\nDeveloped a website for my friend for his startup company,paellachicago.com Toolkit : HTML5, CSS3, JQuery and JavaScript\n\n"},{"date_start":"2001 - 2005","jobtitle":"Executive","text":" Chair), Maths Club(Executive council member), EE club (Executive council member)\n\n"}],"misc":[{"Interests":" Tennis - USTA Flexi league player Board Games - Member of Chicago gaming meetup group.\n\nPage7\n\nAntony Deepak Thomas Software Engineer antonydeepak@gmail.com\n\nContact Antony Deepak on LinkedIn\n"}]}